<a href="https://colab.research.google.com/github/speculate123/Project202103ML/blob/master/Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).
[Errno 2] No such file or directory: '../drive/Mydrive'
/content/Project202103ML

In [1]:
!rm -r ./Project202103ML/
!git clone https://github.com/speculate123/Project202103ML.git
%cd ./Project202103ML/

Cloning into 'Project202103ML'...
remote: Enumerating objects: 53, done.
remote: Counting objects: 100% (53/53), done.
remote: Compressing objects: 100% (44/44), done.
remote: Total 53 (delta 21), reused 21 (delta 3), pack-reused 0
Unpacking objects: 100% (53/53), done.
/content/Project202103ML

In [50]:
import DB
import pandas as pd
data = pd.read_csv("data/HistoricalData_1617305671760.csv")
data

Connecting to database:
Database connected.

            Date Close/Last     Volume      Open       High        Low
0     03/31/2021    $122.15  118323800   $121.65    $123.52    $121.15
1     03/30/2021     $119.9   85671920   $120.11  $120.4031    $118.86
2     03/29/2021    $121.39   80819200   $121.65    $122.58  $120.7299
3     03/26/2021    $121.21   94071230   $120.35    $121.48    $118.92
4     03/25/2021    $120.59   98844680   $119.54    $121.66       $119
...          ...        ...        ...       ...        ...        ...
2511  04/07/2011   $12.0743  373073251   $12.075   $12.1582   $12.0011
2512  04/06/2011   $12.0729  401842959  $12.1864   $12.2821   $12.0407
2513  04/05/2011   $12.1032  482607247  $12.0354   $12.2232        $12
2514  04/04/2011   $12.1854  459004936  $12.2968   $12.3071   $12.0857
2515  04/01/2011   $12.3057  417983833  $12.5396   $12.5567   $12.2607

[2516 rows x 6 columns]

In [25]:
data['Date'] = pd.to_datetime(data['Date'])
data = data.rename(columns={"Close/Last": "Close"})
data['Close'] = data['Close'].map(lambda x: x.lstrip('$'))
data['Open'] = data['Open'].map(lambda x: x.lstrip('$'))
data['High'] = data['High'].map(lambda x: x.lstrip('$'))
data['Low'] = data['Low'].map(lambda x: x.lstrip('$'))
data

           Date    Close     Volume     Open      High       Low
0    2021-03-31   122.15  118323800   121.65    123.52    121.15
1    2021-03-30    119.9   85671920   120.11  120.4031    118.86
2    2021-03-29   121.39   80819200   121.65    122.58  120.7299
3    2021-03-26   121.21   94071230   120.35    121.48    118.92
4    2021-03-25   120.59   98844680   119.54    121.66       119
...         ...      ...        ...      ...       ...       ...
2511 2011-04-07  12.0743  373073251   12.075   12.1582   12.0011
2512 2011-04-06  12.0729  401842959  12.1864   12.2821   12.0407
2513 2011-04-05  12.1032  482607247  12.0354   12.2232        12
2514 2011-04-04  12.1854  459004936  12.2968   12.3071   12.0857
2515 2011-04-01  12.3057  417983833  12.5396   12.5567   12.2607

[2516 rows x 6 columns]

In [30]:
data.to_csv('data.csv', index=True)

In [35]:
cursor.execute("""CREATE TABLE AAPL(
id SERIAL PRIMARY KEY,
date DATE,
close DECIMAL(8,4),
age INT,
open DECIMAL(8,4),
high DECIMAL(8,4),
low DECIMAL(8,4))""")
connection.commit()

In [36]:
sql = """
SELECT "table_name","column_name", "data_type", "table_schema"
FROM INFORMATION_SCHEMA.COLUMNS
WHERE "table_schema" = 'public'
ORDER BY table_name  
"""
pd.read_sql(sql, con=connection)

  table_name column_name data_type table_schema
0       aapl        open   numeric       public
1       aapl        date      date       public
2       aapl          id   integer       public
3       aapl         age   integer       public
4       aapl         low   numeric       public
5       aapl       close   numeric       public
6       aapl        high   numeric       public

In [37]:
with open('data.csv', 'r') as row:
    next(row)# Skip the header row.
    cursor.copy_from(row, 'AAPL', sep=',')
connection.commit()

In [47]:
sql = """
SELECT * FROM aapl 
WHERE Date BETWEEN '2011-04-02' AND '2011-04-07'
"""
pd.read_sql(sql, con=connection)

     id        date    close        age     open     high      low
0  2511  2011-04-07  12.0743  373073251  12.0750  12.1582  12.0011
1  2512  2011-04-06  12.0729  401842959  12.1864  12.2821  12.0407
2  2513  2011-04-05  12.1032  482607247  12.0354  12.2232  12.0000
3  2514  2011-04-04  12.1854  459004936  12.2968  12.3071  12.0857